# AcquireExportPDFSettingsAndLocation

## Description
Asks the user for the Export PDF settings and the PDF file name (or folder name if the parameter is true).  This is intended to support Batch PDF Export.

```pascal
FUNCTION AcquireExportPDFSettingsAndLocation(inbSeparateDocuments : BOOLEAN): BOOLEAN;
```

```python
def vs.AcquireExportPDFSettingsAndLocation(inbSeparateDocuments):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inbSeparateDocuments|BOOLEAN|   |

## Version
Availability: from VectorWorks12.5

## Category
* Command